package basic_html;
//각종 데이터 리스트 배열을 가지고 있는 클래스

public class datalist {
	public String[][] product(){
		String product[][] = {
				{"솔브리빙 논슬립 내구성 좋은 고급형 옷걸이","Y","37000","30400","17","250"},
				{"코끼리리빙 문걸이 전신거울","Y","265740","258120","2","310"},
				{"리빙스타 스탠드 행거 트리","Y","46700","35900","23","16"},
				{"스피드랙 업그레이드형 홈던트하우스 철제 선반","N","35900","","","33"},
				{"보노하우스 슬림서랍장 4단","N","30400","","","70"},
				{"보노하우스 맥스 서랍장 2단","Y","141000","54900","61","120"},
				{"스피드랙 업그레이드형 홈던트하우스 철제 선반 3단","Y","144160","132740","7","44"},
				{"스피드랙 업그레이드형 홈던트하우스 조립식 행거","N","30400","","","57"},
				{"리빙스타 모던 스탠드 행거 화이트","Y","29900","23900","20","314"}
		};
		return product;
	}
	
	public String[][] notice(){
		String notice[][] = {
	            {"“가장 널리 사용하는 LTS 버전은 자바 17”","InfoWorld","2025-01-08","146"},
	         	{"“입문자부터 숙련자까지” 주의해야 할 러스트 프로그래밍 실수 6가지”","데크플레이션","2024-12-20","56"},
	         	{"ASCII 3D 렌더러 만들기","IT 뉴스","2024-12-15","98"},
	         	{"깃허브 '코파일럿': 인공지능이 개발자를 대체할 수 있을까?","BBC News 코리아","2024-12-03","41"},
	         	{"‘펜데믹이 끝이 아니었다’··· IT가 직면한 11가지 이슈"," CIO Korea","2024-12-03","33"},
	         	{"IT 개발자 몸값 더 오를 수밖에 없다","ZD Net코리아","2024-12-01","269"}
	    };
		return notice;
	}
}
